# BuiltInFailures.GeneralFailures Class (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
BuiltInFailures..::..GeneralFailures Class
BuiltInFailures Class Members See Also
---
Failures about GeneralFailures.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static class GeneralFailures
```

Visual Basic
---
```text
Public NotInheritable Class GeneralFailures
```

Visual C++
---
```text
public ref class GeneralFailures abstract sealed
```

# Inheritance Hierarchy
System..::..Object Autodesk.Revit.DB..::..BuiltInFailures..::..GeneralFailures
# See Also
BuiltInFailures..::..GeneralFailures Members
Autodesk.Revit.DB Namespace